#**************************************************************
# This .sdc file is created by Terasic Tool.
# Users are recommended to modify this file to match users logic.
#**************************************************************

#**************************************************************
# Create Clock
#**************************************************************
create_clock -period "10.0 MHz" [get_ports ADC_CLK_10]
create_clock -period "50.0 MHz" [get_ports MAX10_CLK1_50]
create_clock -period "50.0 MHz" [get_ports MAX10_CLK2_50]




# SDRAM CLK
create_generated_clock -name {clk_dram_ext} -source [get_pins { m_lab61_soc|sdram_pll|sd1|pll7|clk[1] }] [get_ports {DRAM_CLK}] 
                      


#**************************************************************
# Create Generated Clock
#**************************************************************
derive_pll_clocks



#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************
derive_clock_uncertainty



#**************************************************************
# Set Input Delay
#**************************************************************
# suppose +- 100 ps skew
# Board Delay (Data) + Propagation Delay - Board Delay (Clock)
# max 5.4(max) +0.4(trace delay) +0.1 = 5.9
# min 2.7(min) +0.4(trace delay) -0.1 = 3.0
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[0]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[0]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[1]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[1]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[2]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[2]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[3]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[3]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[4]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[4]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[5]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[5]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[6]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[6]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[7]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[7]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[8]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[8]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[9]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[9]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[10]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[10]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[11]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[11]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[12]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[12]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[13]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[13]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[14]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[14]]
set_input_delay -clock clk_dram_ext -max 5.9 [get_ports DRAM_DQ[15]]
set_input_delay -clock clk_dram_ext -min 3.0 [get_ports DRAM_DQ[15]]

set_input_delay -max -clock clk_dram_ext 5.9 [get_ports KEY[0]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports KEY[0]]
set_input_delay -max -clock clk_dram_ext 5.9 [get_ports KEY[1]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports KEY[1]]

set_input_delay -max -clock clk_dram_ext 5.9 [get_ports SW[0]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports SW[0]]
set_input_delay -max -clock clk_dram_ext 5.9 [get_ports SW[1]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports SW[1]]
set_input_delay -max -clock clk_dram_ext 5.9 [get_ports SW[2]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports SW[2]]
set_input_delay -max -clock clk_dram_ext 5.9 [get_ports SW[3]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports SW[3]]
set_input_delay -max -clock clk_dram_ext 5.9 [get_ports SW[4]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports SW[4]]
set_input_delay -max -clock clk_dram_ext 5.9 [get_ports SW[5]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports SW[5]]
set_input_delay -max -clock clk_dram_ext 5.9 [get_ports SW[6]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports SW[6]]
set_input_delay -max -clock clk_dram_ext 5.9 [get_ports SW[7]]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports SW[7]]

set_input_delay -max -clock clk_dram_ext 5.9 [get_ports altera_reserved_tdi]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports altera_reserved_tdi]
set_input_delay -max -clock clk_dram_ext 5.9 [get_ports altera_reserved_tms]
set_input_delay -min -clock clk_dram_ext 3.0 [get_ports altera_reserved_tms]

#shift-window
set_multicycle_path -from [get_clocks {clk_dram_ext}] \
                    -to [get_clocks { m_lab61_soc|sdram_pll|sd1|pll7|clk[0] }] \
						  -setup 2
						  
#**************************************************************
# Set Output Delay
#**************************************************************
# suppose +- 100 ps skew
# max : Board Delay (Data) - Board Delay (Clock) + tsu (External Device)
# min : Board Delay (Data) - Board Delay (Clock) - th (External Device)
# max 1.5+0.1 =1.6
# min -0.8-0.1 = 0.9
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[0]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[0]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[1]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[1]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[2]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[2]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[3]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[3]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[4]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[4]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[5]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[5]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[6]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[6]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[7]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[7]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[8]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[8]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[9]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[9]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[10]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[10]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[11]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[11]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[12]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[12]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[13]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[13]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[14]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[14]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_DQ[15]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_DQ[15]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[0]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[0]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[1]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[1]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[2]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[2]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[3]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[3]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[4]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[4]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[5]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[5]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[6]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[6]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[7]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[7]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[8]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[8]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[9]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[9]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[10]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[10]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[11]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[11]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_ADDR[12]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_ADDR[12]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_BA[0]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_BA[0]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {DRAM_BA[1] DRAM_RAS_N DRAM_CAS_N DRAM_WE_N DRAM_CKE DRAM_CS_N}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {DRAM_BA[1] DRAM_RAS_N DRAM_CAS_N DRAM_WE_N DRAM_CKE DRAM_CS_N}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {altera_reserved_tdo}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {altera_reserved_tdo}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {LEDR[0]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {LEDR[0]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {LEDR[1]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {LEDR[1]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {LEDR[2]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {LEDR[2]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {LEDR[3]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {LEDR[3]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {LEDR[4]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {LEDR[4]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {LEDR[5]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {LEDR[5]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {LEDR[6]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {LEDR[6]}]
set_output_delay -max -clock clk_dram_ext 1.6  [get_ports {LEDR[7]}]
set_output_delay -min -clock clk_dram_ext -0.9 [get_ports {LEDR[7]}]


#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************
#set false path for switches and LEDs, we don't care when it changes
# set_false_path 
set_false_path -from [get_ports {SW[0] SW[1] SW[2] SW[3] SW[4] SW[5] SW[6] SW[7]}] -to [get_ports {LEDR[0] LEDR[1] LEDR[2] LEDR[3] LEDR[4] LEDR[5] LEDR[6] LEDR[7]}]

#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************



#**************************************************************
# Set Load
#**************************************************************



